{"intro":[{"type":"text","value":"This is a story about onions and math."},{"type":"small","value":"Not your taste? Try something else from <a href=https://pudding.cool>The Pudding</a>."},{"type":"text","value":"Tens of millions of people are curious about how to properly dice an onion, <a href=https://www.youtube.com/results?search_query=how+to+dice+an+onion target=_blank rel=noreferrer>according to YouTube</a>."},{"type":"text","value":"In 2021, renowned Chef / food journalist J. Kenji López-Alt <a href=https://www.instagram.com/p/CV6L30MBFy8/ target=_blank rel=noreferrer>broke out some math</a> to optimize a technique for getting uniform piece sizes."},{"type":"us","value":"How much does uniformity matter?"},{"type":"kenji","value":"<em>It matters*</em> far more for winning internet debates and solving interesting math problems than it does for cooking. For home cooks, having an onion dice that's a little off from perfect is not really an issue anyone should seriously worry about."},{"type":"note","value":"*Emphasis our own"},{"type":"text","value":"Good enough for us!"}],"hed":"The Mathematically Optimal Way to Dice an Onion","author1":"<a target=_blank rel=noreferrer href=https://pudding.cool/author/andrew-aquino>Andrew Aquino</a>","author2":"<a target=_blank rel=noreferrer href=https://pudding.cool/author/russell-samora>Russell Samora</a>","story":[{"type":"text","value":"This is an onion. It is also a series of concentric circles. What’s the best way to cut it? That is, how do we get the most uniform piece size?"},{"type":"Component","value":{}},{"type":"text","value":"Let’s try a common approach - <mark>all vertical cuts</mark>."},{"type":"text","value":"The pieces <strong class=primary>near the center line</strong> are fairly consistent in shape and size."},{"type":"text","value":"But <strong class=secondary>along the bottom</strong> there are some noticeably larger pieces. When you dice an onion, you are probably not imaging pieces like these."},{"type":"Component","value":{}},{"type":"text","value":"This inconsistency can be measured by calculating the <strong>standard deviation</strong>. A higher value means a greater variation in piece size."},{"type":"Component","value":{}},{"type":"note","value":"Adjust the slider to see how the standard deviation changes with the number of cuts."},{"type":"text","value":"Okay, let’s try a different technique - <mark>radial cuts</mark>."},{"type":"text","value":"The piece size still isn’t very consistent - those <strong class=primary>near the outside</strong> are much larger than those <strong class=secondary>near the center</strong>."},{"type":"Component","value":{}},{"type":"text","value":"How does the standard deviation of pieces cut radially compare to those cut vertically?"},{"type":"Component","value":{}},{"type":"text","value":"But we can improve the radial cut strategy. Kenji claims that the most uniform pieces can be produced by <strong>aiming at a point ~60% of the onion’s radius below the cutting surface.</strong>"},{"type":"text","value":"The pieces now look more consistent, except for a few smaller ones <strong class=primary>along the bottom</strong>."},{"type":"Component","value":{}},{"type":"text","value":"Does the math confirm this as the superior technique? / Here is our math suggestion."},{"type":"Component","value":{}},{"type":"text","value":"Brief discussion of our differing methods if applicable."},{"type":"text","value":"But there are more ways to dice an onion. Another popular technique is to start with horizontal cuts before vertical. <strong>Explore all the possibilities below to see the results</strong>."},{"type":"Component","value":{}}]}