{"title":"Dicing an Onion, the Mathematically Optimal Way","description":"There is more than one way to dice an onion…","url":"https://pudding.cool/2025/08/onions","intro":[{"type":"text","value":"<strong>This is a story about onions and math.</strong>"},{"type":"text","value":"Why? Because tens of millions of people are curious about how to properly dice an onion, <a href=https://www.youtube.com/results?search_query=how+to+dice+an+onion target=_blank rel=noreferrer>according to YouTube</a>."},{"type":"text","value":"In 2021, chef and food writer J. Kenji López-Alt <a href=https://www.instagram.com/p/CV6L30MBFy8/ target=_blank rel=noreferrer>broke out some math</a> to get <em>optimal</em> uniform piece sizes. But there is more than one way to dice an onion…"}],"hed":"Dicing an Onion, the Mathematically Optimal Way","author1":"<a target=_blank rel=noreferrer href=https://pudding.cool/author/andrew-aquino>Andrew Aquino</a>","author2":"<a target=_blank rel=noreferrer href=https://pudding.cool/author/russell-samora>Russell Samora</a>","author3":"<a target=_blank rel=noreferrer href=https://pudding.cool/author/jan-diehm>Jan Diehm</a>","story":[{"type":"text","value":"<strong>This is an onion.</strong> (Well, a simplified cross-section of one.)"},{"type":"Component","value":{"showControls":"false","showCuts":"false"}},{"type":"text","value":"What’s the best way to cut it? That is, how do we get the most uniform piece size?"},{"type":"text","value":"A typical onion has about 7-13 layers. For the sake of example, let’s assume our onion has 10 layers. We can represent the layers as concentric circles."},{"type":"text","value":"Let’s start with a common approach&mdash;<strong>vertical cuts</strong>."},{"type":"Component","value":{"letters":"VERTICAL","showControls":"false","highlightExtremes":"true"}},{"type":"text","value":"The pieces <strong class=primary>near the center line</strong> are fairly consistent in shape and size."},{"type":"text","value":"But <strong class=secondary>along the bottom</strong> there are some noticeably larger pieces. When you dice an onion, you’re probably not imagining pieces like these."},{"type":"text","value":"This inconsistency can be measured by calculating the <a href=https://en.wikipedia.org/wiki/Standard_deviation target=_blank>standard deviation</a> of our pieces’ areas."},{"type":"text","value":"<details><summary>A note on the standard deviation</summary><p>In this article when we say standard deviation it refers to <em>relative standard deviation</em>. Relative standard deviation is a ratio of the standard deviation to the average piece size. The average piece size will differ depending on our cutting technique, so measuring the relative standard deviation helps us compare how <em>consistent</em> our piece size is (or, how close our areas are to the average) no matter what the average piece size is.<p></details>"},{"type":"text","value":"Without getting too wonky, just know that <strong>a higher standard deviation means more piece size variation.</strong> So to obtain the most consistently sized pieces, we want to make the standard deviation as <em>small as possible.</em>"},{"type":"text","value":"Adjust the slider below to see how the number of cuts affects the standard deviation. Oh, and don’t forget check out the exploded view toggle to see the variation."},{"type":"Component","value":{"toggleExplode":"true","showStandardDeviation":"true"}},{"type":"text","value":"Okay, let’s try a different technique&mdash;<strong>radial cuts.</strong>"},{"type":"Component","value":{"letters":"RADIAL","showControls":"false","cutType":"radial","highlightExtremes":"true"}},{"type":"text","value":"The piece size still isn’t very consistent&mdash;those <strong class=primary>near the outside</strong> are much larger than those <strong class=secondary>near the center</strong>."},{"type":"text","value":"How does the standard deviation of pieces cut radially compare to those cut vertically?"},{"type":"Component","value":{"cutType":"radial","controlCutType":"true","toggleExplode":"true","showStandardDeviation":"true"}},{"type":"text","value":"When making 10 cuts into a 10-layer onion radially, the standard deviation (57.7%) is <em>greater</em> than when cutting vertically (37.3%), which means that our piece size is now <em>less</em> consistent."},{"type":"text","value":"But we can improve the radial cut strategy."},{"type":"text","value":"Kenji claims that the most uniform pieces can be produced by <strong>aiming at a point ~60% of the onion’s radius below the cutting surface.</strong>"},{"type":"Component","value":{"letters":"POINT BELOW","showControls":"false","cutType":"radial","cutTargetDepthPercentage":"0.6","highlightExtremes":"true","showStandardDeviation":"true","showRadialTarget":"true"}},{"type":"text","value":"The pieces now look more consistent, except for a few smaller ones <strong class=primary>along the bottom</strong>."},{"type":"text","value":"Does the math confirm ~60% depth as the superior technique?"},{"type":"text","value":"Indeed, 34.5% is the smallest standard deviation we’ve seen so far. This finding is further supported by Dr. Dylan Poulsen, an associate professor of mathematics at Washington College, who calculated that the ideal “onion constant” is ~55.731% depth (<a href=https://medium.com/@drspoulsen/a-solution-to-the-onion-problem-of-j-kenji-l%C3%B3pez-alt-c3c4ab22e67c target=_blank rel=noreferrer>source</a>, <a href=https://drspoulsen.github.io/MARP/ target=_blank rel=noreferrer>another source</a>). Kenji backs Dr. Poulsen’s method in <a href=https://www.nytimes.com/article/how-to-cut-onion.html target=_blank rel=noreferrer>this more recent New York Times article</a>."},{"type":"text","value":"But we can improve the radial cut strategy even more!"},{"type":"text","value":"Dr. Poulsen’s analysis is based on making <em>infinitely many cuts</em> into an onion with <em>infinitely many layers</em>:"},{"type":"text","value":"<figure><img  alt=\"Screenshot from Dr. Poulsen’s slides. A diagram shows an onion cross-section with an unrealistically large number of layers. A caption reads: ‘So, we might as well consider the limiting case as the number of layers approaches infinity.’\" src=\"assets/slide.jpg\"><figcaption>A slide from Dr. Poulsen’s breakdown on the math behind onion cutting.</figcaption></figure>"},{"type":"text","value":"However, in the physical world we’re only capable of making a finite number of cuts, and real onions have a finite number of layers. The diagrams from Kenji’s original claim show 10 cuts being made into an onion with 10 layers. How can we optimize that?"},{"type":"text","value":"<strong>When making 10 cuts into a 10-layer onion, the smallest standard deviation (29.5%) occurs when making radial cuts aimed 96% of the onion’s radius below the cutting surface! 😮</strong>"},{"type":"Component","value":{"controlCutType":"true","cutType":"radial","controlRadialDepth":"true","cutTargetDepthPercentage":"0.96","toggleExplode":"true","showStandardDeviation":"true"}},{"type":"text","value":"Before we explain how we got that result, let’s briefly consider another popular technique: making 1-2 horizontal cuts before vertical, <a href=https://www.youtube.com/watch?v=BuebC0CfD8E&t=79s target=_blank rel=noreferrer>which Kenji recommended in 2016</a>. What does the math say about this strategy? How does combining it with vertical/radial cuts affect our piece size?"},{"type":"Component","value":{"letters":"EXPLORE","controlLayers":"true","controlCutType":"true","controlRadialDepth":"true","controlHorizontalCuts":"true","toggleExplode":"true","showStandardDeviation":"true"}},{"type":"text","value":"<details><summary>How do you find the size of an onion piece?</summary><p>Onions and onion pieces are 3D objects with volumes, but we’re analyzing areas of 2-dimensional cross-sections to simplify the math.</p><p>When making vertical cuts, we can obtain the area of an onion piece in the <em>bottom</em> layer by calculating the area under a circular curve in a given horizontal range. When we want the area of an onion piece in an <em>upper</em> layer, we take the area under its higher circular curve and subtract the area under its lower circular curve.</p><p>The calculation for radially cut onion pieces is generally the same. However, cutting radially produces diagonal lines. We also add the area under the diagonal line to the left of the piece, and subtract the area under the diagonal line to the right of the piece.</p></details>"},{"type":"text","value":"<h3>Optimal techniques</h3>"},{"type":"text","value":"Here are the minimum standard deviations for every combination of layer numbers, vertical/radial cut numbers, radial cut depth, and horizontal cut numbers:"},{"type":"Report","value":{}},{"type":"text","value":"<h3>Insights</h3>"},{"type":"list","value":["It turns out that making horizontal cuts almost never helps with consistency.","Radial cuts are usually more consistent than vertical cuts, but you have to aim below the center of the onion.","The ideal radial depth varies depending on the number of layers/cuts&mdash;but it’s always ≥48%. (Recall that this converges to the onion constant of ~55.731%, mentioned above.)"]}],"conclusion":[{"type":"text","value":"Armed with this knowledge, we can apply the optimal dicing strategy to any onion. But how big a difference does being mathematically optimal make when it comes to cooking? We got in touch with Kenji via email to find out."},{"type":"text","value":"<strong>Us&mdash;</strong> How much does uniformity matter?"},{"type":"text","value":"<strong>Kenji&mdash;</strong> “It matters far more for winning internet debates and solving interesting math problems than it does for cooking. For home cooks, having onion dice that are a little off from perfect is not really an issue anyone should seriously worry about.”"},{"type":"text","value":"Oh…"},{"type":"text","value":"Well anyways, we hoped you enjoyed reading this deep-dive about onions and math. And even if your food still tastes the same, you can show off your optimally uniform onion pieces in your next meal."}],"method":[]}